app/controllers/admin_controller.rb

SELECT "settings".* FROM "settings" WHERE "settings"."title" = 'SITE_VISIBLE' LIMIT 1
---
  def index
    @settings = Setting.order("title ASC")