app/controllers/individual_types_controller.rb

  def create

    @individual_type = IndividualType.new(params[:individual_type])
    if @individual_type.save
---
INSERT INTO "individual_types" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 18 Dec 2013 17:42:18 CET +01:00], ["title", nil], ["updated_at", Wed, 18 Dec 2013 17:42:18 CET +01:00]]

  def update
    @individual_type = IndividualType.find_by_title(params[:id])

    if @individual_type.update_attributes(params[:individual_type])
---
UPDATE "individual_types" SET "title" = 'new_test', "updated_at" = '2013-12-18 16:42:18.052884' WHERE "individual_types"."id" = 4