app/controllers/traductions_controller.rb

SELECT "translations".* FROM "translations" WHERE "translations"."locale" = 'en' AND "translations"."key" = 'test' LIMIT 1
INSERT INTO "translations" ("created_at", "interpolations", "is_proc", "key", "locale", "updated_at", "value") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    save_successfull = true
    params[:value].each do |value|
      if !value[1].blank?
        if !Translation.find_by_locale_and_key(value[0], params[:key])
          translation = {:locale => value[0],
                         :key => params[:key],
                         :value => value[1]
                        }
          new_trans = Translation.new(translation)
          if !new_trans.save

SELECT "translations".* FROM "translations" WHERE "translations"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def edit
    @translation = Translation.find(params[:id])

SELECT "translations".* FROM "translations" WHERE "translations"."key" = 'hello'
UPDATE "translations" SET "value" = 'new hello', "updated_at" = '2013-12-18 16:42:17.448410' WHERE "translations"."id" = 3
INSERT INTO "translations" ("created_at", "interpolations", "is_proc", "key", "locale", "updated_at", "value") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
DELETE FROM "translations" WHERE "translations"."id" = $1  [["id", 5]]
---
  def update
    save_successfull = true
    @translations = Translation.where(:key => params[:key])
    params[:value].each do |value|
      translation = @translations.select {|trans| trans.locale == value[0]}
      if !value[1].blank?
        if translation.count > 0
          if translation.first.value != value[1]
            if !translation.first.update_attributes(:value => value[1])
              save_successfull = false
            end
          end
        else
          translation = {:locale => value[0],
                         :key => params[:key],
                         :value => value[1]
                        }
          new_trans = Translation.new(translation)
          if !new_trans.save
            save_successfull = false
          end
        end
      else
        if translation.count > 0
          if !translation.first.destroy